local module = {}
local timetaken = tick()
function module.Load(config)
	script:SetAttribute("key",game:GetService("HttpService"):JSONEncode(config))
	script.Parent = game.ReplicatedStorage
	local q = script.Setup
	q.Parent = game.StarterPlayer.StarterPlayerScripts
	local b = script.Listener
	b.Parent = game.ServerScriptService
	local c = script.SafeChatRemote
	c.Parent= game.ReplicatedStorage
	q.Disabled = false
	b.Disabled = false
	local a = script._Setup
	for _,i in game:GetService("Players"):GetPlayers() do -- make sure every player have safechat gui
		local m = a:Clone()
		m.Parent = i.PlayerGui
		m.Disabled = false
	end
	game:GetService("TestService"):Message([[



 ██████╗ █████╗ ███████╗███████╗ █████╗ ██╗  ██╗ █████╗ ████████╗██████╗ ██╗     ██╗   ██╗ ██████╗
██╔════╝██╔══██╗██╔════╝██╔════╝██╔══██╗██║  ██║██╔══██╗╚══██╔══╝██╔══██╗██║     ██║   ██║██╔════╝
╚█████╗ ███████║█████╗  █████╗  ██║  ╚═╝███████║███████║   ██║   ██████╔╝██║     ██║   ██║╚█████╗ 
 ╚═══██╗██╔══██║██╔══╝  ██╔══╝  ██║  ██╗██╔══██║██╔══██║   ██║   ██╔═══╝ ██║     ██║   ██║ ╚═══██╗
██████╔╝██║  ██║██║     ███████╗╚█████╔╝██║  ██║██║  ██║   ██║   ██║     ███████╗╚██████╔╝██████╔╝
╚═════╝ ╚═╝  ╚═╝╚═╝     ╚══════╝ ╚════╝ ╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝   ╚═╝     ╚══════╝ ╚═════╝ ╚═════╝ 
	
𝗦𝗮𝗳𝗲𝗖𝗵𝗮𝘁𝗣𝗹𝘂𝘀 made by MaybeNotTheSomeoneYK Loaded! Took ]]..(tick()-timetaken)..[[ seconds to load


]])
	wait(1)
	script:Destroy()
end

return module
